In [2]:
# update to the latest version
# ! git pull

# Pandas

Pandas is an open source library providing high-performance, easy-to-use data structures and data analysis tools for the Python programming language.<br>
* A fast and efficient DataFrame object for data manipulation with integrated indexing
* Tools for reading and writing data between in-memory data structures and different formats: CSV and text files, Microsoft Excel, SQL databases
* Intelligent data alignment and integrated handling of missing data: gain automatic label-based alignment in computations and easily manipulate messy data into an orderly form
* Flexible reshaping and pivoting of data sets;
* Intelligent label-based slicing, fancy indexing, and subsetting of large data sets;
* Columns can be inserted and deleted from data structures for size mutability;
* Aggregating or transforming data with a powerful group by engine allowing split-apply-combine operations on data sets
* High performance merging and joining of data sets
* Time series-functionality: date range generation and frequency conversion, moving window statistics, moving window linear regressions, date shifting and lagging<br>
<br>
The documentation can be found on
https://pandas.pydata.org/index.html

In [3]:
import pandas as pd #import pandas
import numpy as np
import matplotlib.pyplot as plt
import datetime as dt
%matplotlib inline
plt.style.use('ggplot')
pd.set_option('display.max_rows', 50)
pd.set_option('display.max_columns', 30)

## 1. Series

* a one-dimensional object similar to an array, list, or column in a table. 
* It will assign a labeled index to each item in the Series. 
* By default, each item will receive an index label from 0 to N, where N is the length of the Series minus one.

In [4]:
serie = pd.Series([3,3.14,'Seven',None])
serie

0        3
1     3.14
2    Seven
3     None
dtype: object

#### Index
we can also specify the index to be something different than increasing integer numbers

In [5]:
serie2 = pd.Series([3,3.14,'Seven',None], index=['a','b','c','d'])
serie2

a        3
b     3.14
c    Seven
d     None
dtype: object

or you can change it again

In [6]:
serie2.index = ['integer','float','string','null']
serie2

integer        3
float       3.14
string     Seven
null        None
dtype: object

### Create a series from a dictionary
This is very useful, because a dictionary is a python representation of a `json` format

In [7]:
d_cities_population = {'Amsterdam':821752,
     'Istanbul':15030000,
     'London': 8200000, 
     'Paris': 2206000, 
     'Frankfurt':  732688 , 
     'Berlin': 3700000, 
     'Hamburg': 1800000, 
     'Manchester': 541000}
cities_population = pd.Series(d_cities_population)
cities_population

Amsterdam       821752
Istanbul      15030000
London         8200000
Paris          2206000
Frankfurt       732688
Berlin         3700000
Hamburg        1800000
Manchester      541000
dtype: int64

## Accessing the data

#### Index

In [8]:
cities_population.index

Index(['Amsterdam', 'Istanbul', 'London', 'Paris', 'Frankfurt', 'Berlin',
       'Hamburg', 'Manchester'],
      dtype='object')

#### Values

In [9]:
cities_population.values

array([  821752, 15030000,  8200000,  2206000,   732688,  3700000,
        1800000,   541000])

## Sorting and Filtering

### Sort the cities by population

In [10]:
# if you do not specify ascending = False, it will use the default value
# which is ascending = True
cities_population.sort_values(ascending = False)

Istanbul      15030000
London         8200000
Berlin         3700000
Paris          2206000
Hamburg        1800000
Amsterdam       821752
Frankfurt       732688
Manchester      541000
dtype: int64

## Intermezzo 
It is always useful to read the documentation of the function.<br>
For this you can use the help function from the Jupyter Notebook

In [11]:
help(cities_population.sort_values)

Help on method sort_values in module pandas.core.series:

sort_values(axis=0, ascending=True, inplace=False, kind='quicksort', na_position='last') method of pandas.core.series.Series instance
    Sort by the values.

    Sort a Series in ascending or descending order by some
    criterion.

    Parameters
    ----------
    axis : {0 or 'index'}, default 0
        Axis to direct sorting. The value 'index' is accepted for
        compatibility with DataFrame.sort_values.
    ascending : bool, default True
        If True, sort values in ascending order, otherwise descending.
    inplace : bool, default False
        If True, perform operation in-place.
    kind : {'quicksort', 'mergesort' or 'heapsort'}, default 'quicksort'
        Choice of sorting algorithm. See also :func:`numpy.sort` for more
        information. 'mergesort' is the only stable  algorithm.
    na_position : {'first' or 'last'}, default 'last'
        Argument 'first' puts NaNs at the beginning, 'last' puts NaNs at
        the end.

    Returns
    -------
    Series
        Series ordered by values.

    See Also
    --------
    Series.sort_index : Sort by the Series indices.
    DataFrame.sort_values : Sort DataFrame by the values along either axis.
    DataFrame.sort_index : Sort DataFrame by indices.

    Examples
    --------
    >>> s = pd.Series([np.nan, 1, 3, 10, 5])
    >>> s
    0     NaN
    1     1.0
    2     3.0
    3     10.0
    4     5.0
    dtype: float64

    Sort values ascending order (default behaviour)

    >>> s.sort_values(ascending=True)
    1     1.0
    2     3.0
    4     5.0
    3    10.0
    0     NaN
    dtype: float64

    Sort values descending order

    >>> s.sort_values(ascending=False)
    3    10.0
    4     5.0
    2     3.0
    1     1.0
    0     NaN
    dtype: float64

    Sort values inplace

    >>> s.sort_values(ascending=False, inplace=True)
    >>> s
    3    10.0
    4     5.0
    2     3.0
    1     1.0
    0     NaN
    dtype: float64

    Sort values putting NAs first

    >>> s.sort_values(na_position='first')
    0     NaN
    1     1.0
    2     3.0
    4     5.0
    3    10.0
    dtype: float64

    Sort a series of strings

    >>> s = pd.Series(['z', 'b', 'd', 'a', 'c'])
    >>> s
    0    z
    1    b
    2    d
    3    a
    4    c
    dtype: object

    >>> s.sort_values()
    3    a
    1    b
    4    c
    2    d
    0    z
    dtype: object

# Exercise 1
What happens if we use <br>
`cities_population.sort_values(inplace=True)`

### Filtering

I am interested in knowing which cities have more than 1 million citizens

In [12]:
cities_population>1000000

Amsterdam     False
Istanbul       True
London         True
Paris          True
Frankfurt     False
Berlin         True
Hamburg        True
Manchester    False
dtype: bool

Now it returns a mask (`true` or `false`) that can be used for filtering.<br>
Example

In [13]:
cities_population[cities_population>1000000]

Istanbul    15030000
London       8200000
Paris        2206000
Berlin       3700000
Hamburg      1800000
dtype: int64

Or the inverse by using the `~` sign in fron of the mask

In [14]:
mask = cities_population>1000000

In [15]:
cities_population[~mask]

Amsterdam     821752
Frankfurt     732688
Manchester    541000
dtype: int64

#### Note!!!<br> 
you can save the masked filter into a variable (in the example `mask`) or use it explicity (like done above

### Create a dataframe from two series.
For this purpose, we need a new series with similar indexes<br>
Let's create one

In [16]:
d_cities_country = {'Amsterdam':'Netherlands',
     'Istanbul':'Turkey',
     'London': 'UK', 
     'Paris': 'France', 
     'Frankfurt': 'Germany', 
     'Berlin': 'Germany', 
     'Hamburg': 'Germany', 
     'Lyon':'France',
     'Manchester': 'UK'}
cities_country = pd.Series(d_cities_country)
cities_country

Amsterdam     Netherlands
Istanbul           Turkey
London                 UK
Paris              France
Frankfurt         Germany
Berlin            Germany
Hamburg           Germany
Lyon               France
Manchester             UK
dtype: object

### Counting values
How many cities do I have per country in by dataset?

In [17]:
cities_country.value_counts()

Germany        3
UK             2
France         2
Netherlands    1
Turkey         1
dtype: int64

### Note the output of value_counts is a Serie, where now the index is the unique value, and the value is the number of times it appears

What would happen if we apply `value_counts` twice, i.e.<br>

`cities_country.value_counts().value_counts()`?

# 2 Dataframes

* Two-dimensional size-mutable, potentially heterogeneous tabular data structure with labeled axes (rows and columns). 
* Arithmetic operations align on both row and column labels. 
* Can be thought of as a dict-like container for Series objects. 
* The primary pandas data structure.

### pandas concat

Read the `help(pd.concat)` to see what this is doing

In [18]:
pd.concat([cities_country, cities_population])

Amsterdam     Netherlands
Istanbul           Turkey
London                 UK
Paris              France
Frankfurt         Germany
Berlin            Germany
Hamburg           Germany
Lyon               France
Manchester             UK
Amsterdam          821752
Istanbul         15030000
London            8200000
Paris             2206000
Frankfurt          732688
Berlin            3700000
Hamburg           1800000
Manchester         541000
dtype: object

### Not really what we wanted, right?
* Pandas uses a `'two-dimensional'` representation of the data (table), with  rows and columns.<br>
* When applying an operation, we need to specify the direction (i.e. along the rows of the columns)<br>
* This is defined by the `axis` parameter

In [19]:
### concat along the 2nd axix (python starts indexing from 0)
### We will save the output into a new object, called cities
cities=pd.concat([cities_country, cities_population], axis = 1)

/Users/we56sc/.miniconda3/envs/py36/lib/python3.6/site-packages/ipykernel_launcher.py:3: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  This is separate from the ipykernel package so we can avoid doing imports until

In [20]:
cities

                      0           1
Amsterdam   Netherlands    821752.0
Berlin          Germany   3700000.0
Frankfurt       Germany    732688.0
Hamburg         Germany   1800000.0
Istanbul         Turkey  15030000.0
London               UK   8200000.0
Lyon             France         NaN
Manchester           UK    541000.0
Paris            France   2206000.0

#### This is a DataFrame

In [21]:
type(cities)

pandas.core.frame.DataFrame

### How about we give a nice name to the columns?

In [22]:
cities.columns=['Country','Population']
cities

                Country  Population
Amsterdam   Netherlands    821752.0
Berlin          Germany   3700000.0
Frankfurt       Germany    732688.0
Hamburg         Germany   1800000.0
Istanbul         Turkey  15030000.0
London               UK   8200000.0
Lyon             France         NaN
Manchester           UK    541000.0
Paris            France   2206000.0

### Accessing the column

In [23]:
cities['Country']

Amsterdam     Netherlands
Berlin            Germany
Frankfurt         Germany
Hamburg           Germany
Istanbul           Turkey
London                 UK
Lyon               France
Manchester             UK
Paris              France
Name: Country, dtype: object

# Exercise 2:
What is the difference between :
* `cities['Country']`
* `cities[['Country']]`
* `cities.Country`

### Filters, sorting
It works the same way as in Series<br>
Let's filter out the missing value of `Lyon`
the function isnull() will tell if the value is null or not

cities.isnull()

and we can use this mapping for filtering values

In [24]:
cities[~cities.Population.isnull()] #remember, ~ is negation

                Country  Population
Amsterdam   Netherlands    821752.0
Berlin          Germany   3700000.0
Frankfurt       Germany    732688.0
Hamburg         Germany   1800000.0
Istanbul         Turkey  15030000.0
London               UK   8200000.0
Manchester           UK    541000.0
Paris            France   2206000.0

## Operations on the DataFrame

Let's create a function that will categorise the cities in EU and non EU ones

In [25]:
def is_EU(x):
    return x in ['Netherlands','Germany','UK','France']

def is_EU_after2019(x):
    '''
    remove the UK after Brexit
    '''
    return x in ['Netherlands','Germany','France']

In [26]:
cities['Country'].apply(is_EU)

Amsterdam      True
Berlin         True
Frankfurt      True
Hamburg        True
Istanbul      False
London         True
Lyon           True
Manchester     True
Paris          True
Name: Country, dtype: bool

In [27]:
cities['Country'].apply(is_EU_after2019)

Amsterdam      True
Berlin         True
Frankfurt      True
Hamburg        True
Istanbul      False
London        False
Lyon           True
Manchester    False
Paris          True
Name: Country, dtype: bool

### But We would like something nicer, like a column saying if it is EU or non EU

In [28]:
cities

                Country  Population
Amsterdam   Netherlands    821752.0
Berlin          Germany   3700000.0
Frankfurt       Germany    732688.0
Hamburg         Germany   1800000.0
Istanbul         Turkey  15030000.0
London               UK   8200000.0
Lyon             France         NaN
Manchester           UK    541000.0
Paris            France   2206000.0

### Applying a function return a series. We can add it as a new column to the dataframe

In [29]:
cities['isEU']=cities['Country'].apply(is_EU_after2019)

In [30]:
cities

                Country  Population   isEU
Amsterdam   Netherlands    821752.0   True
Berlin          Germany   3700000.0   True
Frankfurt       Germany    732688.0   True
Hamburg         Germany   1800000.0   True
Istanbul         Turkey  15030000.0  False
London               UK   8200000.0  False
Lyon             France         NaN   True
Manchester           UK    541000.0  False
Paris            France   2206000.0   True

In [31]:
### Lets now convert it into Strings
cities['European_Union']=cities.isEU.apply(lambda x: 'EU' if x else 'no EU')

In [32]:
cities

                Country  Population   isEU European_Union
Amsterdam   Netherlands    821752.0   True             EU
Berlin          Germany   3700000.0   True             EU
Frankfurt       Germany    732688.0   True             EU
Hamburg         Germany   1800000.0   True             EU
Istanbul         Turkey  15030000.0  False          no EU
London               UK   8200000.0  False          no EU
Lyon             France         NaN   True             EU
Manchester           UK    541000.0  False          no EU
Paris            France   2206000.0   True             EU

### The drop function

In [33]:
cities.drop('isEU', axis=1)

                Country  Population European_Union
Amsterdam   Netherlands    821752.0             EU
Berlin          Germany   3700000.0             EU
Frankfurt       Germany    732688.0             EU
Hamburg         Germany   1800000.0             EU
Istanbul         Turkey  15030000.0          no EU
London               UK   8200000.0          no EU
Lyon             France         NaN             EU
Manchester           UK    541000.0          no EU
Paris            France   2206000.0             EU

### The same can be achieved by selecting the columns we want to keep

In [34]:
cities[['Country','Population','European_Union']]

                Country  Population European_Union
Amsterdam   Netherlands    821752.0             EU
Berlin          Germany   3700000.0             EU
Frankfurt       Germany    732688.0             EU
Hamburg         Germany   1800000.0             EU
Istanbul         Turkey  15030000.0          no EU
London               UK   8200000.0          no EU
Lyon             France         NaN             EU
Manchester           UK    541000.0          no EU
Paris            France   2206000.0             EU

In [35]:
#REMOVE IN PLACE
cities.drop('isEU',inplace=True, axis=1)

In [36]:
cities

                Country  Population European_Union
Amsterdam   Netherlands    821752.0             EU
Berlin          Germany   3700000.0             EU
Frankfurt       Germany    732688.0             EU
Hamburg         Germany   1800000.0             EU
Istanbul         Turkey  15030000.0          no EU
London               UK   8200000.0          no EU
Lyon             France         NaN             EU
Manchester           UK    541000.0          no EU
Paris            France   2206000.0             EU

## Missing Values

Missing values can be replaced by the fillna function.<br>
Let's see the help

In [37]:
help(cities.fillna)

Help on method fillna in module pandas.core.frame:

fillna(value=None, method=None, axis=None, inplace=False, limit=None, downcast=None, **kwargs) method of pandas.core.frame.DataFrame instance
    Fill NA/NaN values using the specified method.

    Parameters
    ----------
    value : scalar, dict, Series, or DataFrame
        Value to use to fill holes (e.g. 0), alternately a
        dict/Series/DataFrame of values specifying which value to use for
        each index (for a Series) or column (for a DataFrame). (values not
        in the dict/Series/DataFrame will not be filled). This value cannot
        be a list.
    method : {'backfill', 'bfill', 'pad', 'ffill', None}, default None
        Method to use for filling holes in reindexed Series
        pad / ffill: propagate last valid observation forward to next valid
        backfill / bfill: use NEXT valid observation to fill gap
    axis : {0 or 'index', 1 or 'columns'}
    inplace : boolean, default False
        If True, fill in place. Note: this will modify any
        other views on this object, (e.g. a no-copy slice for a column in a
        DataFrame).
    limit : int, default None
        If method is specified, this is the maximum number of consecutive
        NaN values to forward/backward fill. In other words, if there is
        a gap with more than this number of consecutive NaNs, it will only
        be partially filled. If method is not specified, this is the
        maximum number of entries along the entire axis where NaNs will be
        filled. Must be greater than 0 if not None.
    downcast : dict, default is None
        a dict of item->dtype of what to downcast if possible,
        or the string 'infer' which will try to downcast to an appropriate
        equal type (e.g. float64 to int64 if possible)

    Returns
    -------
    filled : DataFrame

    See Also
    --------
    interpolate : Fill NaN values using interpolation.
    reindex, asfreq

    Examples
    --------
    >>> df = pd.DataFrame([[np.nan, 2, np.nan, 0],
    ...                    [3, 4, np.nan, 1],
    ...                    [np.nan, np.nan, np.nan, 5],
    ...                    [np.nan, 3, np.nan, 4]],
    ...                    columns=list('ABCD'))
    >>> df
         A    B   C  D
    0  NaN  2.0 NaN  0
    1  3.0  4.0 NaN  1
    2  NaN  NaN NaN  5
    3  NaN  3.0 NaN  4

    Replace all NaN elements with 0s.

    >>> df.fillna(0)
        A   B   C   D
    0   0.0 2.0 0.0 0
    1   3.0 4.0 0.0 1
    2   0.0 0.0 0.0 5
    3   0.0 3.0 0.0 4

    We can also propagate non-null values forward or backward.

    >>> df.fillna(method='ffill')
        A   B   C   D
    0   NaN 2.0 NaN 0
    1   3.0 4.0 NaN 1
    2   3.0 4.0 NaN 5
    3   3.0 3.0 NaN 4

    Replace all NaN elements in column 'A', 'B', 'C', and 'D', with 0, 1,
    2, and 3 respectively.

    >>> values = {'A': 0, 'B': 1, 'C': 2, 'D': 3}
    >>> df.fillna(value=values)
        A   B   C   D
    0   0.0 2.0 2.0 0
    1   3.0 4.0 2.0 1
    2   0.0 1.0 2.0 5
    3   0.0 3.0 2.0 4

    Only replace the first NaN element.

    >>> df.fillna(value=values, limit=1)
        A   B   C   D
    0   0.0 2.0 2.0 0
    1   3.0 4.0 NaN 1
    2   NaN 1.0 NaN 5
    3   NaN 3.0 NaN 4

For our use case, we want to replace the Population of Lyon with the value we know from Wikipedia, cca half a milion

In [38]:
cities.fillna(value=500000)

                Country  Population European_Union
Amsterdam   Netherlands    821752.0             EU
Berlin          Germany   3700000.0             EU
Frankfurt       Germany    732688.0             EU
Hamburg         Germany   1800000.0             EU
Istanbul         Turkey  15030000.0          no EU
London               UK   8200000.0          no EU
Lyon             France    500000.0             EU
Manchester           UK    541000.0          no EU
Paris            France   2206000.0             EU

### It might be a bit safer to specify directly the column

In [39]:
cities.Population.fillna(value=500000,inplace=True) # note the inplace=True

In [40]:
cities

                Country  Population European_Union
Amsterdam   Netherlands    821752.0             EU
Berlin          Germany   3700000.0             EU
Frankfurt       Germany    732688.0             EU
Hamburg         Germany   1800000.0             EU
Istanbul         Turkey  15030000.0          no EU
London               UK   8200000.0          no EU
Lyon             France    500000.0             EU
Manchester           UK    541000.0          no EU
Paris            France   2206000.0             EU

## Exercise 3:
The population is a float. Convert it to integers

*** your solution here ***

## Group-By and Aggregations

In [41]:
grouped_cities = cities.groupby('Country')

Is it a Dataframe? Not really

In [42]:
type(grouped_cities)

pandas.core.groupby.generic.DataFrameGroupBy

#### Loop over the different groups

In [43]:
for group, df in grouped_cities:
    print(df)
    print('\n')

      Country  Population European_Union
Lyon   France    500000.0             EU
Paris  France   2206000.0             EU


           Country  Population European_Union
Berlin     Germany   3700000.0             EU
Frankfurt  Germany    732688.0             EU
Hamburg    Germany   1800000.0             EU


               Country  Population European_Union
Amsterdam  Netherlands    821752.0             EU


         Country  Population European_Union
Istanbul  Turkey  15030000.0          no EU


           Country  Population European_Union
London          UK   8200000.0          no EU
Manchester      UK    541000.0          no EU

### Apply functions

Sum the population of the country

In [44]:
grouped_cities['Population'].sum()

Country
France          2706000.0
Germany         6232688.0
Netherlands      821752.0
Turkey         15030000.0
UK              8741000.0
Name: Population, dtype: float64

### Multiple aggregations

In [45]:
countries = grouped_cities['Population'].aggregate({'Total population':'sum', 'Average_popoulation':'mean'})
countries

/Users/we56sc/.miniconda3/envs/py36/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: using a dict on a Series for aggregation
is deprecated and will be removed in a future version
  """Entry point for launching an IPython kernel.

             Total population  Average_popoulation
Country
France              2706000.0         1.353000e+06
Germany             6232688.0         2.077563e+06
Netherlands          821752.0         8.217520e+05
Turkey             15030000.0         1.503000e+07
UK                  8741000.0         4.370500e+06

#### The group-by key (Country in our case) is by default is now an index.

But it is probably more useful to have it as a columt in a new DataFrame.<br>
If you check the groupby documentation, we can see that there is the parameters `as_index`, which is True by default.<br>
Setting it to False does the trick

In [46]:
countries = cities.groupby('Country', as_index=False)['Population'].aggregate(
    {'Total_population':'sum', 'Average_popoulation':'mean'}
)
countries

       Country  Total_population  Average_popoulation
0       France         2706000.0         1.353000e+06
1      Germany         6232688.0         2.077563e+06
2  Netherlands          821752.0         8.217520e+05
3       Turkey        15030000.0         1.503000e+07
4           UK         8741000.0         4.370500e+06

## Joining DataFrames
https://pandas.pydata.org/pandas-docs/stable/merging.html

In [47]:
help(pd.merge)

Help on function merge in module pandas.core.reshape.merge:

merge(left, right, how='inner', on=None, left_on=None, right_on=None, left_index=False, right_index=False, sort=False, suffixes=('_x', '_y'), copy=True, indicator=False, validate=None)
    Merge DataFrame or named Series objects with a database-style join.

    The join is done on columns or indexes. If joining columns on
    columns, the DataFrame indexes *will be ignored*. Otherwise if joining indexes
    on indexes or indexes on a column or columns, the index will be passed on.

    Parameters
    ----------
    left : DataFrame
    right : DataFrame or named Series
        Object to merge with.
    how : {'left', 'right', 'outer', 'inner'}, default 'inner'
        Type of merge to be performed.

        * left: use only keys from left frame, similar to a SQL left outer join;
          preserve key order.
        * right: use only keys from right frame, similar to a SQL right outer join;
          preserve key order.
        * outer: use union of keys from both frames, similar to a SQL full outer
          join; sort keys lexicographically.
        * inner: use intersection of keys from both frames, similar to a SQL inner
          join; preserve the order of the left keys.
    on : label or list
        Column or index level names to join on. These must be found in both
        DataFrames. If `on` is None and not merging on indexes then this defaults
        to the intersection of the columns in both DataFrames.
    left_on : label or list, or array-like
        Column or index level names to join on in the left DataFrame. Can also
        be an array or list of arrays of the length of the left DataFrame.
        These arrays are treated as if they are columns.
    right_on : label or list, or array-like
        Column or index level names to join on in the right DataFrame. Can also
        be an array or list of arrays of the length of the right DataFrame.
        These arrays are treated as if they are columns.
    left_index : bool, default False
        Use the index from the left DataFrame as the join key(s). If it is a
        MultiIndex, the number of keys in the other DataFrame (either the index
        or a number of columns) must match the number of levels.
    right_index : bool, default False
        Use the index from the right DataFrame as the join key. Same caveats as
        left_index.
    sort : bool, default False
        Sort the join keys lexicographically in the result DataFrame. If False,
        the order of the join keys depends on the join type (how keyword).
    suffixes : tuple of (str, str), default ('_x', '_y')
        Suffix to apply to overlapping column names in the left and right
        side, respectively. To raise an exception on overlapping columns use
        (False, False).
    copy : bool, default True
        If False, avoid copy if possible.
    indicator : bool or str, default False
        If True, adds a column to output DataFrame called "_merge" with
        information on the source of each row.
        If string, column with information on source of each row will be added to
        output DataFrame, and column will be named value of string.
        Information column is Categorical-type and takes on a value of "left_only"
        for observations whose merge key only appears in 'left' DataFrame,
        "right_only" for observations whose merge key only appears in 'right'
        DataFrame, and "both" if the observation's merge key is found in both.

    validate : str, optional
        If specified, checks if merge is of specified type.

        * "one_to_one" or "1:1": check if merge keys are unique in both
          left and right datasets.
        * "one_to_many" or "1:m": check if merge keys are unique in left
          dataset.
        * "many_to_one" or "m:1": check if merge keys are unique in right
          dataset.
        * "many_to_many" or "m:m": allowed, but does not result in checks.

        .. versionadded:: 0.21.0

    Returns
    -------
    DataFrame
        A DataFrame of the two merged objects.

    See Also
    --------
    merge_ordered : Merge with optional filling/interpolation.
    merge_asof : Merge on nearest keys.
    DataFrame.join : Similar method using indices.

    Notes
    -----
    Support for specifying index levels as the `on`, `left_on`, and
    `right_on` parameters was added in version 0.23.0
    Support for merging named Series objects was added in version 0.24.0

    Examples
    --------

    >>> df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
    ...                     'value': [1, 2, 3, 5]})
    >>> df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
    ...                     'value': [5, 6, 7, 8]})
    >>> df1
        lkey value
    0   foo      1
    1   bar      2
    2   baz      3
    3   foo      5
    >>> df2
        rkey value
    0   foo      5
    1   bar      6
    2   baz      7
    3   foo      8

    Merge df1 and df2 on the lkey and rkey columns. The value columns have
    the default suffixes, _x and _y, appended.

    >>> df1.merge(df2, left_on='lkey', right_on='rkey')
      lkey  value_x rkey  value_y
    0  foo        1  foo        5
    1  foo        1  foo        8
    2  foo        5  foo        5
    3  foo        5  foo        8
    4  bar        2  bar        6
    5  baz        3  baz        7

    Merge DataFrames df1 and df2 with specified left and right suffixes
    appended to any overlapping columns.

    >>> df1.merge(df2, left_on='lkey', right_on='rkey',
    ...           suffixes=('_left', '_right'))
      lkey  value_left rkey  value_right
    0  foo           1  foo            5
    1  foo           1  foo            8
    2  foo           5  foo            5
    3  foo           5  foo            8
    4  bar           2  bar            6
    5  baz           3  baz            7

    Merge DataFrames df1 and df2, but raise an exception if the DataFrames have
    any overlapping columns.

    >>> df1.merge(df2, left_on='lkey', right_on='rkey', suffixes=(False, False))
    Traceback (most recent call last):
    ...
    ValueError: columns overlap but no suffix specified:
        Index(['value'], dtype='object')

In [48]:
pd.merge(left=cities,
        right = countries,
        on='Country')

,Country,Population,European_Union,Total_population,Average_popoulation
0,Netherlands,821752.0,EU,821752.0,8.217520e+05
1,Germany,3700000.0,EU,6232688.0,2.077563e+06
2,Germany,732688.0,EU,6232688.0,2.077563e+06
3,Germany,1800000.0,EU,6232688.0,2.077563e+06
4,Turkey,15030000.0,no EU,15030000.0,1.503000e+07
5,UK,8200000.0,no EU,8741000.0,4.370500e+06
6,UK,541000.0,no EU,8741000.0,4.370500e+06
7,France,500000.0,EU,2706000.0,1.353000e+06
8,France,2206000.0,EU,2706000.0,1.353000e+06

### Where are the names of the cities?

In [49]:
cities['City'] = cities.index

In [50]:
cities.reset_index(drop=True, inplace=True)

### Now we can rejoin

In [51]:
extended_cities = pd.merge(left=cities,
        right = countries,
        on='Country')
extended_cities

,Country,Population,European_Union,City,Total_population,Average_popoulation
0,Netherlands,821752.0,EU,Amsterdam,821752.0,8.217520e+05
1,Germany,3700000.0,EU,Berlin,6232688.0,2.077563e+06
2,Germany,732688.0,EU,Frankfurt,6232688.0,2.077563e+06
3,Germany,1800000.0,EU,Hamburg,6232688.0,2.077563e+06
4,Turkey,15030000.0,no EU,Istanbul,15030000.0,1.503000e+07
5,UK,8200000.0,no EU,London,8741000.0,4.370500e+06
6,UK,541000.0,no EU,Manchester,8741000.0,4.370500e+06
7,France,500000.0,EU,Lyon,2706000.0,1.353000e+06
8,France,2206000.0,EU,Paris,2706000.0,1.353000e+06

## Now we have more information. We could use it to create more features/variables

For instance, I want to know which fraction of the country population is from a given city

In [52]:
extended_cities['Populatiion_fraction']=extended_cities['Population']/extended_cities['Total_population']
extended_cities

,Country,Population,European_Union,City,Total_population,Average_popoulation,Populatiion_fraction
0,Netherlands,821752.0,EU,Amsterdam,821752.0,8.217520e+05,1.000000
1,Germany,3700000.0,EU,Berlin,6232688.0,2.077563e+06,0.593644
2,Germany,732688.0,EU,Frankfurt,6232688.0,2.077563e+06,0.117556
3,Germany,1800000.0,EU,Hamburg,6232688.0,2.077563e+06,0.288800
4,Turkey,15030000.0,no EU,Istanbul,15030000.0,1.503000e+07,1.000000
5,UK,8200000.0,no EU,London,8741000.0,4.370500e+06,0.938108
6,UK,541000.0,no EU,Manchester,8741000.0,4.370500e+06,0.061892
7,France,500000.0,EU,Lyon,2706000.0,1.353000e+06,0.184775
8,France,2206000.0,EU,Paris,2706000.0,1.353000e+06,0.815225

# 3 Reading data from files

So far we have seen academic examples with random generated data.<br>
Let's actually see how we can import data from files

In [53]:
help(pd.read_csv)

Help on function read_csv in module pandas.io.parsers:

read_csv(filepath_or_buffer, sep=',', delimiter=None, header='infer', names=None, index_col=None, usecols=None, squeeze=False, prefix=None, mangle_dupe_cols=True, dtype=None, engine=None, converters=None, true_values=None, false_values=None, skipinitialspace=False, skiprows=None, skipfooter=0, nrows=None, na_values=None, keep_default_na=True, na_filter=True, verbose=False, skip_blank_lines=True, parse_dates=False, infer_datetime_format=False, keep_date_col=False, date_parser=None, dayfirst=False, iterator=False, chunksize=None, compression='infer', thousands=None, decimal=b'.', lineterminator=None, quotechar='"', quoting=0, doublequote=True, escapechar=None, comment=None, encoding=None, dialect=None, tupleize_cols=None, error_bad_lines=True, warn_bad_lines=True, delim_whitespace=False, low_memory=True, memory_map=False, float_precision=None)
    Read a comma-separated values (csv) file into DataFrame.

    Also supports optionally iterating or breaking of the file
    into chunks.

    Additional help can be found in the online docs for
    `IO Tools <http://pandas.pydata.org/pandas-docs/stable/io.html>`_.

    Parameters
    ----------
    filepath_or_buffer : str, path object, or file-like object
        Any valid string path is acceptable. The string could be a URL. Valid
        URL schemes include http, ftp, s3, and file. For file URLs, a host is
        expected. A local file could be: file://localhost/path/to/table.csv.

        If you want to pass in a path object, pandas accepts either
        ``pathlib.Path`` or ``py._path.local.LocalPath``.

        By file-like object, we refer to objects with a ``read()`` method, such as
        a file handler (e.g. via builtin ``open`` function) or ``StringIO``.
    sep : str, default ','
        Delimiter to use. If sep is None, the C engine cannot automatically detect
        the separator, but the Python parsing engine can, meaning the latter will
        be used and automatically detect the separator by Python's builtin sniffer
        tool, ``csv.Sniffer``. In addition, separators longer than 1 character and
        different from ``'\s+'`` will be interpreted as regular expressions and
        will also force the use of the Python parsing engine. Note that regex
        delimiters are prone to ignoring quoted data. Regex example: ``'\r\t'``.
    delimiter : str, default ``None``
        Alias for sep.
    header : int, list of int, default 'infer'
        Row number(s) to use as the column names, and the start of the
        data.  Default behavior is to infer the column names: if no names
        are passed the behavior is identical to ``header=0`` and column
        names are inferred from the first line of the file, if column
        names are passed explicitly then the behavior is identical to
        ``header=None``. Explicitly pass ``header=0`` to be able to
        replace existing names. The header can be a list of integers that
        specify row locations for a multi-index on the columns
        e.g. [0,1,3]. Intervening rows that are not specified will be
        skipped (e.g. 2 in this example is skipped). Note that this
        parameter ignores commented lines and empty lines if
        ``skip_blank_lines=True``, so ``header=0`` denotes the first line of
        data rather than the first line of the file.
    names : array-like, optional
        List of column names to use. If file contains no header row, then you
        should explicitly pass ``header=None``. Duplicates in this list will cause
        a ``UserWarning`` to be issued.
    index_col : int, sequence or bool, optional
        Column to use as the row labels of the DataFrame. If a sequence is given, a
        MultiIndex is used. If you have a malformed file with delimiters at the end
        of each line, you might consider ``index_col=False`` to force pandas to
        not use the first column as the index (row names).
    usecols : list-like or callable, optional
        Return a subset of the columns. If list-like, all elements must either
        be positional (i.e. integer indices into the document columns) or strings
        that correspond to column names provided either by the user in `names` or
        inferred from the document header row(s). For example, a valid list-like
        `usecols` parameter would be ``[0, 1, 2]`` or ``['foo', 'bar', 'baz']``.
        Element order is ignored, so ``usecols=[0, 1]`` is the same as ``[1, 0]``.
        To instantiate a DataFrame from ``data`` with element order preserved use
        ``pd.read_csv(data, usecols=['foo', 'bar'])[['foo', 'bar']]`` for columns
        in ``['foo', 'bar']`` order or
        ``pd.read_csv(data, usecols=['foo', 'bar'])[['bar', 'foo']]``
        for ``['bar', 'foo']`` order.

        If callable, the callable function will be evaluated against the column
        names, returning names where the callable function evaluates to True. An
        example of a valid callable argument would be ``lambda x: x.upper() in
        ['AAA', 'BBB', 'DDD']``. Using this parameter results in much faster
        parsing time and lower memory usage.
    squeeze : bool, default False
        If the parsed data only contains one column then return a Series.
    prefix : str, optional
        Prefix to add to column numbers when no header, e.g. 'X' for X0, X1, ...
    mangle_dupe_cols : bool, default True
        Duplicate columns will be specified as 'X', 'X.1', ...'X.N', rather than
        'X'...'X'. Passing in False will cause data to be overwritten if there
        are duplicate names in the columns.
    dtype : Type name or dict of column -> type, optional
        Data type for data or columns. E.g. {'a': np.float64, 'b': np.int32,
        'c': 'Int64'}
        Use `str` or `object` together with suitable `na_values` settings
        to preserve and not interpret dtype.
        If converters are specified, they will be applied INSTEAD
        of dtype conversion.
    engine : {'c', 'python'}, optional
        Parser engine to use. The C engine is faster while the python engine is
        currently more feature-complete.
    converters : dict, optional
        Dict of functions for converting values in certain columns. Keys can either
        be integers or column labels.
    true_values : list, optional
        Values to consider as True.
    false_values : list, optional
        Values to consider as False.
    skipinitialspace : bool, default False
        Skip spaces after delimiter.
    skiprows : list-like, int or callable, optional
        Line numbers to skip (0-indexed) or number of lines to skip (int)
        at the start of the file.

        If callable, the callable function will be evaluated against the row
        indices, returning True if the row should be skipped and False otherwise.
        An example of a valid callable argument would be ``lambda x: x in [0, 2]``.
    skipfooter : int, default 0
        Number of lines at bottom of file to skip (Unsupported with engine='c').
    nrows : int, optional
        Number of rows of file to read. Useful for reading pieces of large files.
    na_values : scalar, str, list-like, or dict, optional
        Additional strings to recognize as NA/NaN. If dict passed, specific
        per-column NA values.  By default the following values are interpreted as
        NaN: '', '#N/A', '#N/A N/A', '#NA', '-1.#IND', '-1.#QNAN', '-NaN', '-nan',
        '1.#IND', '1.#QNAN', 'N/A', 'NA', 'NULL', 'NaN', 'n/a', 'nan',
        'null'.
    keep_default_na : bool, default True
        Whether or not to include the default NaN values when parsing the data.
        Depending on whether `na_values` is passed in, the behavior is as follows:

        * If `keep_default_na` is True, and `na_values` are specified, `na_values`
          is appended to the default NaN values used for parsing.
        * If `keep_default_na` is True, and `na_values` are not specified, only
          the default NaN values are used for parsing.
        * If `keep_default_na` is False, and `na_values` are specified, only
          the NaN values specified `na_values` are used for parsing.
        * If `keep_default_na` is False, and `na_values` are not specified, no
          strings will be parsed as NaN.

        Note that if `na_filter` is passed in as False, the `keep_default_na` and
        `na_values` parameters will be ignored.
    na_filter : bool, default True
        Detect missing value markers (empty strings and the value of na_values). In
        data without any NAs, passing na_filter=False can improve the performance
        of reading a large file.
    verbose : bool, default False
        Indicate number of NA values placed in non-numeric columns.
    skip_blank_lines : bool, default True
        If True, skip over blank lines rather than interpreting as NaN values.
    parse_dates : bool or list of int or names or list of lists or dict, default False
        The behavior is as follows:

        * boolean. If True -> try parsing the index.
        * list of int or names. e.g. If [1, 2, 3] -> try parsing columns 1, 2, 3
          each as a separate date column.
        * list of lists. e.g.  If [[1, 3]] -> combine columns 1 and 3 and parse as
          a single date column.
        * dict, e.g. {'foo' : [1, 3]} -> parse columns 1, 3 as date and call
          result 'foo'

        If a column or index cannot be represented as an array of datetimes,
        say because of an unparseable value or a mixture of timezones, the column
        or index will be returned unaltered as an object data type. For
        non-standard datetime parsing, use ``pd.to_datetime`` after
        ``pd.read_csv``. To parse an index or column with a mixture of timezones,
        specify ``date_parser`` to be a partially-applied
        :func:`pandas.to_datetime` with ``utc=True``. See
        :ref:`io.csv.mixed_timezones` for more.

        Note: A fast-path exists for iso8601-formatted dates.
    infer_datetime_format : bool, default False
        If True and `parse_dates` is enabled, pandas will attempt to infer the
        format of the datetime strings in the columns, and if it can be inferred,
        switch to a faster method of parsing them. In some cases this can increase
        the parsing speed by 5-10x.
    keep_date_col : bool, default False
        If True and `parse_dates` specifies combining multiple columns then
        keep the original columns.
    date_parser : function, optional
        Function to use for converting a sequence of string columns to an array of
        datetime instances. The default uses ``dateutil.parser.parser`` to do the
        conversion. Pandas will try to call `date_parser` in three different ways,
        advancing to the next if an exception occurs: 1) Pass one or more arrays
        (as defined by `parse_dates`) as arguments; 2) concatenate (row-wise) the
        string values from the columns defined by `parse_dates` into a single array
        and pass that; and 3) call `date_parser` once for each row using one or
        more strings (corresponding to the columns defined by `parse_dates`) as
        arguments.
    dayfirst : bool, default False
        DD/MM format dates, international and European format.
    iterator : bool, default False
        Return TextFileReader object for iteration or getting chunks with
        ``get_chunk()``.
    chunksize : int, optional
        Return TextFileReader object for iteration.
        See the `IO Tools docs
        <http://pandas.pydata.org/pandas-docs/stable/io.html#io-chunking>`_
        for more information on ``iterator`` and ``chunksize``.
    compression : {'infer', 'gzip', 'bz2', 'zip', 'xz', None}, default 'infer'
        For on-the-fly decompression of on-disk data. If 'infer' and
        `filepath_or_buffer` is path-like, then detect compression from the
        following extensions: '.gz', '.bz2', '.zip', or '.xz' (otherwise no
        decompression). If using 'zip', the ZIP file must contain only one data
        file to be read in. Set to None for no decompression.

        .. versionadded:: 0.18.1 support for 'zip' and 'xz' compression.

    thousands : str, optional
        Thousands separator.
    decimal : str, default '.'
        Character to recognize as decimal point (e.g. use ',' for European data).
    lineterminator : str (length 1), optional
        Character to break file into lines. Only valid with C parser.
    quotechar : str (length 1), optional
        The character used to denote the start and end of a quoted item. Quoted
        items can include the delimiter and it will be ignored.
    quoting : int or csv.QUOTE_* instance, default 0
        Control field quoting behavior per ``csv.QUOTE_*`` constants. Use one of
        QUOTE_MINIMAL (0), QUOTE_ALL (1), QUOTE_NONNUMERIC (2) or QUOTE_NONE (3).
    doublequote : bool, default ``True``
       When quotechar is specified and quoting is not ``QUOTE_NONE``, indicate
       whether or not to interpret two consecutive quotechar elements INSIDE a
       field as a single ``quotechar`` element.
    escapechar : str (length 1), optional
        One-character string used to escape other characters.
    comment : str, optional
        Indicates remainder of line should not be parsed. If found at the beginning
        of a line, the line will be ignored altogether. This parameter must be a
        single character. Like empty lines (as long as ``skip_blank_lines=True``),
        fully commented lines are ignored by the parameter `header` but not by
        `skiprows`. For example, if ``comment='#'``, parsing
        ``#empty\na,b,c\n1,2,3`` with ``header=0`` will result in 'a,b,c' being
        treated as the header.
    encoding : str, optional
        Encoding to use for UTF when reading/writing (ex. 'utf-8'). `List of Python
        standard encodings
        <https://docs.python.org/3/library/codecs.html#standard-encodings>`_ .
    dialect : str or csv.Dialect, optional
        If provided, this parameter will override values (default or not) for the
        following parameters: `delimiter`, `doublequote`, `escapechar`,
        `skipinitialspace`, `quotechar`, and `quoting`. If it is necessary to
        override values, a ParserWarning will be issued. See csv.Dialect
        documentation for more details.
    tupleize_cols : bool, default False
        Leave a list of tuples on columns as is (default is to convert to
        a MultiIndex on the columns).

        .. deprecated:: 0.21.0
           This argument will be removed and will always convert to MultiIndex

    error_bad_lines : bool, default True
        Lines with too many fields (e.g. a csv line with too many commas) will by
        default cause an exception to be raised, and no DataFrame will be returned.
        If False, then these "bad lines" will dropped from the DataFrame that is
        returned.
    warn_bad_lines : bool, default True
        If error_bad_lines is False, and warn_bad_lines is True, a warning for each
        "bad line" will be output.
    delim_whitespace : bool, default False
        Specifies whether or not whitespace (e.g. ``' '`` or ``'    '``) will be
        used as the sep. Equivalent to setting ``sep='\s+'``. If this option
        is set to True, nothing should be passed in for the ``delimiter``
        parameter.

        .. versionadded:: 0.18.1 support for the Python parser.

    low_memory : bool, default True
        Internally process the file in chunks, resulting in lower memory use
        while parsing, but possibly mixed type inference.  To ensure no mixed
        types either set False, or specify the type with the `dtype` parameter.
        Note that the entire file is read into a single DataFrame regardless,
        use the `chunksize` or `iterator` parameter to return the data in chunks.
        (Only valid with C parser).
    memory_map : bool, default False
        If a filepath is provided for `filepath_or_buffer`, map the file object
        directly onto memory and access the data directly from there. Using this
        option can improve performance because there is no longer any I/O overhead.
    float_precision : str, optional
        Specifies which converter the C engine should use for floating-point
        values. The options are `None` for the ordinary converter,
        `high` for the high-precision converter, and `round_trip` for the
        round-trip converter.

    Returns
    -------
    DataFrame or TextParser
        A comma-separated values (csv) file is returned as two-dimensional
        data structure with labeled axes.

    See Also
    --------
    to_csv : Write DataFrame to a comma-separated values (csv) file.
    read_csv : Read a comma-separated values (csv) file into DataFrame.
    read_fwf : Read a table of fixed-width formatted lines into DataFrame.

    Examples
    --------
    >>> pd.read_csv('data.csv')  # doctest: +SKIP

In [54]:
data = pd.read_csv('data/UCI_Credit_Card.csv')

The dataset has been downloaded from kaggle

https://www.kaggle.com/uciml/default-of-credit-card-clients-dataset

### Let's get some general information about the dataset

How many rows and columns?

In [55]:
data.shape
# 30000 rows and 25 columns

(30000, 25)

Which columns do we have?

In [56]:
data.columns

Index(['ID', 'LIMIT_BAL', 'SEX', 'EDUCATION', 'MARRIAGE', 'AGE', 'PAY_0',
       'PAY_2', 'PAY_3', 'PAY_4', 'PAY_5', 'PAY_6', 'BILL_AMT1', 'BILL_AMT2',
       'BILL_AMT3', 'BILL_AMT4', 'BILL_AMT5', 'BILL_AMT6', 'PAY_AMT1',
       'PAY_AMT2', 'PAY_AMT3', 'PAY_AMT4', 'PAY_AMT5', 'PAY_AMT6',
       'default.payment.next.month'],
      dtype='object')

Can we say something more about it? For instance, of which type is the data contained in the columns?

In [57]:
data.dtypes

ID                              int64
LIMIT_BAL                     float64
SEX                             int64
EDUCATION                       int64
MARRIAGE                        int64
AGE                             int64
PAY_0                           int64
PAY_2                           int64
PAY_3                           int64
PAY_4                           int64
PAY_5                           int64
PAY_6                           int64
BILL_AMT1                     float64
BILL_AMT2                     float64
BILL_AMT3                     float64
BILL_AMT4                     float64
BILL_AMT5                     float64
BILL_AMT6                     float64
PAY_AMT1                      float64
PAY_AMT2                      float64
PAY_AMT3                      float64
PAY_AMT4                      float64
PAY_AMT5                      float64
PAY_AMT6                      float64
default.payment.next.month      int64
dtype: object

# Important:

Before doing any data science project, it is important to understand the inputs?
On the kaggle website you can find the information about the dataset, which is reported below

Content

There are 25 variables:

* ID: ID of each client
* LIMIT_BAL: Amount of given credit in NT dollars (includes individual and family/supplementary credit
* SEX: Gender (1=male, 2=female)
* EDUCATION: (1=graduate school, 2=university, 3=high school, 4=others, 5=unknown, 6=unknown)
* MARRIAGE: Marital status (1=married, 2=single, 3=others)
* AGE: Age in years
* PAY_0: Repayment status in September, 2005 (-1=pay duly, 1=payment delay for one month, 2=payment delay for two months, ... 8=payment delay for eight months, 9=payment delay for nine months and above)
* PAY_2: Repayment status in August, 2005 (scale same as above)
* PAY_3: Repayment status in July, 2005 (scale same as above)
* PAY_4: Repayment status in June, 2005 (scale same as above)
* PAY_5: Repayment status in May, 2005 (scale same as above)
* PAY_6: Repayment status in April, 2005 (scale same as above)
* BILL_AMT1: Amount of bill statement in September, 2005 (NT dollar)
* BILL_AMT2: Amount of bill statement in August, 2005 (NT dollar)
* BILL_AMT3: Amount of bill statement in July, 2005 (NT dollar)
* BILL_AMT4: Amount of bill statement in June, 2005 (NT dollar)
* BILL_AMT5: Amount of bill statement in May, 2005 (NT dollar)
* BILL_AMT6: Amount of bill statement in April, 2005 (NT dollar)
* PAY_AMT1: Amount of previous payment in September, 2005 (NT dollar)
* PAY_AMT2: Amount of previous payment in August, 2005 (NT dollar)
* PAY_AMT3: Amount of previous payment in July, 2005 (NT dollar)
* PAY_AMT4: Amount of previous payment in June, 2005 (NT dollar)
* PAY_AMT5: Amount of previous payment in May, 2005 (NT dollar)
* PAY_AMT6: Amount of previous payment in April, 2005 (NT dollar)
* default.payment.next.month: Default payment (1=yes, 0=no)

### Hmmm... Why in the Pay column we have a 0 for september, and in the rest is a 1?
Let's rename it

# Exercise: 
Convert the name of the column from PAY_0 to PAY_1

In [58]:
*** your solution here ***

SyntaxError: invalid syntax (<ipython-input-58-2b91ed9bb2e4>, line 1)

Checking only the first 10 rows to inspect the values

In [59]:
data.head(10)

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,PAY_5,PAY_6,BILL_AMT1,BILL_AMT2,BILL_AMT3,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default.payment.next.month
0,1,20000.0,2,2,1,24,2,2,-1,-1,-2,-2,3913.0,3102.0,689.0,0.0,0.0,0.0,0.0,689.0,0.0,0.0,0.0,0.0,1
1,2,120000.0,2,2,2,26,-1,2,0,0,0,2,2682.0,1725.0,2682.0,3272.0,3455.0,3261.0,0.0,1000.0,1000.0,1000.0,0.0,2000.0,1
2,3,90000.0,2,2,2,34,0,0,0,0,0,0,29239.0,14027.0,13559.0,14331.0,14948.0,15549.0,1518.0,1500.0,1000.0,1000.0,1000.0,5000.0,0
3,4,50000.0,2,2,1,37,0,0,0,0,0,0,46990.0,48233.0,49291.0,28314.0,28959.0,29547.0,2000.0,2019.0,1200.0,1100.0,1069.0,1000.0,0
4,5,50000.0,1,2,1,57,-1,0,-1,0,0,0,8617.0,5670.0,35835.0,20940.0,19146.0,19131.0,2000.0,36681.0,10000.0,9000.0,689.0,679.0,0
5,6,50000.0,1,1,2,37,0,0,0,0,0,0,64400.0,57069.0,57608.0,19394.0,19619.0,20024.0,2500.0,1815.0,657.0,1000.0,1000.0,800.0,0
6,7,500000.0,1,1,2,29,0,0,0,0,0,0,367965.0,412023.0,445007.0,542653.0,483003.0,473944.0,55000.0,40000.0,38000.0,20239.0,13750.0,13770.0,0
7,8,100000.0,2,2,2,23,0,-1,-1,0,0,-1,11876.0,380.0,601.0,221.0,-159.0,567.0,380.0,601.0,0.0,581.0,1687.0,1542.0,0
8,9,140000.0,2,3,1,28,0,0,2,0,0,0,11285.0,14096.0,12108.0,12211.0,11793.0,3719.0,3329.0,0.0,432.0,1000.0,1000.0,1000.0,0
9,10,20000.0,1,3,2,35,-2,-2,-2,-2,-1,-1,0.0,0.0,0.0,0.0,13007.0,13912.0,0.0,0.0,0.0,13007.0,1122.0,0.0,0

Or the last 7

In [60]:
data.tail(7)

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,PAY_5,PAY_6,BILL_AMT1,BILL_AMT2,BILL_AMT3,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default.payment.next.month
29993,29994,100000.0,1,1,2,38,0,-1,-1,0,0,0,3042.0,1427.0,102996.0,70626.0,69473.0,55004.0,2000.0,111784.0,4000.0,3000.0,2000.0,2000.0,0
29994,29995,80000.0,1,2,2,34,2,2,2,2,2,2,72557.0,77708.0,79384.0,77519.0,82607.0,81158.0,7000.0,3500.0,0.0,7000.0,0.0,4000.0,1
29995,29996,220000.0,1,3,1,39,0,0,0,0,0,0,188948.0,192815.0,208365.0,88004.0,31237.0,15980.0,8500.0,20000.0,5003.0,3047.0,5000.0,1000.0,0
29996,29997,150000.0,1,3,2,43,-1,-1,-1,-1,0,0,1683.0,1828.0,3502.0,8979.0,5190.0,0.0,1837.0,3526.0,8998.0,129.0,0.0,0.0,0
29997,29998,30000.0,1,2,2,37,4,3,2,-1,0,0,3565.0,3356.0,2758.0,20878.0,20582.0,19357.0,0.0,0.0,22000.0,4200.0,2000.0,3100.0,1
29998,29999,80000.0,1,3,1,41,1,-1,0,0,0,-1,-1645.0,78379.0,76304.0,52774.0,11855.0,48944.0,85900.0,3409.0,1178.0,1926.0,52964.0,1804.0,1
29999,30000,50000.0,1,2,1,46,0,0,0,0,0,0,47929.0,48905.0,49764.0,36535.0,32428.0,15313.0,2078.0,1800.0,1430.0,1000.0,1000.0,1000.0,1

## See some statistics about my dataset

In [61]:
data.describe() # shows the basic stats about the dataset

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,PAY_5,PAY_6,BILL_AMT1,BILL_AMT2,BILL_AMT3,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default.payment.next.month
count,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,3.000000e+04,30000.000000,30000.000000,30000.000000,30000.000000,3.000000e+04,30000.00000,30000.000000,30000.000000,30000.000000,30000.000000
mean,15000.500000,167484.322667,1.603733,1.853133,1.551867,35.485500,-0.016700,-0.133767,-0.166200,-0.220667,-0.266200,-0.291100,51223.330900,49179.075167,4.701315e+04,43262.948967,40311.400967,38871.760400,5663.580500,5.921163e+03,5225.68150,4826.076867,4799.387633,5215.502567,0.221200
std,8660.398374,129747.661567,0.489129,0.790349,0.521970,9.217904,1.123802,1.197186,1.196868,1.169139,1.133187,1.149988,73635.860576,71173.768783,6.934939e+04,64332.856134,60797.155770,59554.107537,16563.280354,2.304087e+04,17606.96147,15666.159744,15278.305679,17777.465775,0.415062
min,1.000000,10000.000000,1.000000,0.000000,0.000000,21.000000,-2.000000,-2.000000,-2.000000,-2.000000,-2.000000,-2.000000,-165580.000000,-69777.000000,-1.572640e+05,-170000.000000,-81334.000000,-339603.000000,0.000000,0.000000e+00,0.00000,0.000000,0.000000,0.000000,0.000000
25%,7500.750000,50000.000000,1.000000,1.000000,1.000000,28.000000,-1.000000,-1.000000,-1.000000,-1.000000,-1.000000,-1.000000,3558.750000,2984.750000,2.666250e+03,2326.750000,1763.000000,1256.000000,1000.000000,8.330000e+02,390.00000,296.000000,252.500000,117.750000,0.000000
50%,15000.500000,140000.000000,2.000000,2.000000,2.000000,34.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,22381.500000,21200.000000,2.008850e+04,19052.000000,18104.500000,17071.000000,2100.000000,2.009000e+03,1800.00000,1500.000000,1500.000000,1500.000000,0.000000
75%,22500.250000,240000.000000,2.000000,2.000000,2.000000,41.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,67091.000000,64006.250000,6.016475e+04,54506.000000,50190.500000,49198.250000,5006.000000,5.000000e+03,4505.00000,4013.250000,4031.500000,4000.000000,0.000000
max,30000.000000,1000000.000000,2.000000,6.000000,3.000000,79.000000,8.000000,8.000000,8.000000,8.000000,8.000000,8.000000,964511.000000,983931.000000,1.664089e+06,891586.000000,927171.000000,961664.000000,873552.000000,1.684259e+06,896040.00000,621000.000000,426529.000000,528666.000000,1.000000

## Missing values
Before starting processing the data, we need to check if there are any missing values.

In [62]:
data.isnull().head() # returns True if any of the values in the column is missing, otherwise it is a false

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,PAY_5,PAY_6,BILL_AMT1,BILL_AMT2,BILL_AMT3,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default.payment.next.month
0,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False

In [63]:
# any() applieas the any() function on all the columns. 
# If there is a single value that is True, it will return True
data.isnull().any()

ID                            False
LIMIT_BAL                     False
SEX                           False
EDUCATION                     False
MARRIAGE                      False
AGE                           False
PAY_0                         False
PAY_2                         False
PAY_3                         False
PAY_4                         False
PAY_5                         False
PAY_6                         False
BILL_AMT1                     False
BILL_AMT2                     False
BILL_AMT3                     False
BILL_AMT4                     False
BILL_AMT5                     False
BILL_AMT6                     False
PAY_AMT1                      False
PAY_AMT2                      False
PAY_AMT3                      False
PAY_AMT4                      False
PAY_AMT5                      False
PAY_AMT6                      False
default.payment.next.month    False
dtype: bool

In our case we are lucky (all the values are False, we do not have any missing values). <br>
However, in case of missing values, one needs to think of a strategy to deal with them

# Intermezzo: list comprehension in python and applications to a Dataframe
List comprehension is an elegant way to define and create lists in Python. <br>

Example: I want to create a list of the numbers from 1 to 10 that are divisible by 3

In [64]:
# Returns all the numbers from 0 to 9 included
[x for x in range(10)]

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [65]:
# Returns all the numbers from 0 to 9 included where the remainder of the division by 3 is 0 
# (hence numbers divisible by 3)
[x for x in range(10) if x%3==0]

[0, 3, 6, 9]

##### Back to the DataFrames
Example: `data.columns` will return an iterable that will represent the columns of the DataSet. <br>

Let's say we are interested in showing the statistics of the columns related to the BILL of the month.<br>
All of this columns start with `BILL_*`, and we can use this knowledge to select them in one line of code

In [66]:
# List comprehension
# Return all the columns of the dataframe data where the first 4 characthers equal 'BILL'
[col for col in data.columns if col[:4]=='BILL']

['BILL_AMT1', 'BILL_AMT2', 'BILL_AMT3', 'BILL_AMT4', 'BILL_AMT5', 'BILL_AMT6']

In [67]:
# And using this to slice the columns
data[[col for col in data.columns if col[:4]=='BILL']].head() # remember, head() shows only the first 5 rows

   BILL_AMT1  BILL_AMT2  BILL_AMT3  BILL_AMT4  BILL_AMT5  BILL_AMT6
0     3913.0     3102.0      689.0        0.0        0.0        0.0
1     2682.0     1725.0     2682.0     3272.0     3455.0     3261.0
2    29239.0    14027.0    13559.0    14331.0    14948.0    15549.0
3    46990.0    48233.0    49291.0    28314.0    28959.0    29547.0
4     8617.0     5670.0    35835.0    20940.0    19146.0    19131.0

Another example: <br>
    
Let's find the 'categorial' variables: let's assume that categorical variables are those with less than 10 unique values.<br>
`data['PAY_1'].unique()` will return all the unique values of PAY_1 category

In [68]:
print('array:',data['PAY_1'].unique()) # returns the array
print('length:',data['PAY_1'].unique().shape[0]) # returns the length of the array

KeyError: 'PAY_1'

Using list comprehension, we can find the 'categorical' columns

In [69]:
[col for col in data.columns if data[col].unique().shape[0]<10]

['SEX', 'EDUCATION', 'MARRIAGE', 'default.payment.next.month']

## Categorical variables

The trick that we have shown above works in most of the cases, however, one needs to be careful with categorical variables.<br>
By taking the definition from wikipedia:<br>
* In statistics, a categorical variable is a variable that can take on one of a limited, and usually fixed, number of possible values, assigning each individual or other unit of observation to a particular group or nominal category on the basis of some qualitative property.<br>

Categorical variables if represented with numbers (like in our example) could induce our machine learning model in trouble, as the model will interpret them as ordered values.<br>
Take the categorical variables in  our dataset: 
* SEX: Gender (1=male, 2=female)
* EDUCATION: (1=graduate school, 2=university, 3=high school, 4=others, 5=unknown, 6=unknown)
* MARRIAGE: Marital status (1=married, 2=single, 3=others)

One can see that `FEMALE`>`MALE` (2>1), but this does not make any sense from the mathematical point of view.
Let's do the exercise, and then we will see how to deal with it

### Categorical variables: (one-hot) encodings
We would like to represent our categorical variables in a way that our model can process them without wrongly assuming an ordered dependence.<br>
one-hot is a group of bits among which the legal combinations of values are only those with a single high (1) bit and all the others low (0)
Let's see an example that will make it more clear:<br>
in `pandas` you can create one-hot encodings by using pd.get_dummies()

In [89]:
data['SEX'].value_counts()

2    18112
1    11888
Name: SEX, dtype: int64

In [90]:
pd.get_dummies(data['SEX']).head(10)

   1  2
0  0  1
1  0  1
2  0  1
3  0  1
4  1  0
5  1  0
6  1  0
7  0  1
8  0  1
9  1  0

In [91]:
ohe_data = pd.get_dummies(data,columns = ['SEX','MARRIAGE','EDUCATION'])
ohe_data.shape, data.shape

((30000, 37), (30000, 27))

In [72]:
import utils

In [76]:
columns = ['BILL_AMT1', 'BILL_AMT2', 'BILL_AMT3', 'BILL_AMT4', 'BILL_AMT5', 'BILL_AMT6']

0      7704.0
1     17077.0
2    101653.0
3    231334.0
4    109339.0
dtype: float64

In [84]:
def compute_trend(df,columns):
    coordinates = [(-ix,df[column]) for ix, column in enumerate(columns)]
    
    return utils.compute_slope(*coordinates)

In [85]:
data['bill_trend'] = data.apply(lambda x: compute_trend(x,columns), axis =1)

In [87]:
data[columns +['bill_trend']].head()

,BILL_AMT1,BILL_AMT2,BILL_AMT3,BILL_AMT4,BILL_AMT5,BILL_AMT6,bill_trend
0,3913.0,3102.0,689.0,0.0,0.0,0.0,844.571429
1,2682.0,1725.0,2682.0,3272.0,3455.0,3261.0,-247.857143
2,29239.0,14027.0,13559.0,14331.0,14948.0,15549.0,1854.714286
3,46990.0,48233.0,49291.0,28314.0,28959.0,29547.0,4743.257143
4,8617.0,5670.0,35835.0,20940.0,19146.0,19131.0,-2231.514286

#### Note:
* we saved the one-hot encoded DataFrame into a new variable (`ohe_data`)
* if we look at the shape, we added 8 more columns. This what happens with OHE - dimensions can explode quickly!

## Correlation between variables

In [ ]:
ohe_data.corr()

In [ ]:
from plotting import plot_dataframe_correlations

In [ ]:
plot_dataframe_correlations(ohe_data)

### Let's check the correlations with our target variable

In [ ]:
ohe_data.corr()['default.payment.next.month'].sort_values(ascending=False)

# Feature engineering - an example

In view of builiding a model, we would like to enrich the information that we have, by creating features.<br>
This could allow our model to perform better.<br>
<br>
Feature engineering is driven by the creativity of the Data Scientist, common sense, and business logic.<br>
In our problem, we would like to be able to predict defaults (i.e. the value of `default.payment.next.month`). <br>
We see that we have a lot of information available per a single client: by common sense, we can immagine that the comparison of the BILL amount to the total limit on the credit card might be a good indicator of a probable default.<br>
We can create a feature that will be representative of this, by taking the ratio of the BILL_AMT to the LIMIT_BAL

In [ ]:
ohe_data['BILL_AMT1']/ohe_data['LIMIT_BAL']

We could also do it for all the bills, in a loop

In [96]:
# as before
bill_columns = [col for col in ohe_data.columns if col[:4]=='BILL']
bill_columns

['BILL_AMT1', 'BILL_AMT2', 'BILL_AMT3', 'BILL_AMT4', 'BILL_AMT5', 'BILL_AMT6']

We also want to create new names of the columns. We can use the string.format from python.<br>
See this example

In [97]:
for col in bill_columns:
    print('ratio_{}_to_LIMIT'.format(col))

ratio_BILL_AMT1_to_LIMIT
ratio_BILL_AMT2_to_LIMIT
ratio_BILL_AMT3_to_LIMIT
ratio_BILL_AMT4_to_LIMIT
ratio_BILL_AMT5_to_LIMIT
ratio_BILL_AMT6_to_LIMIT

In [98]:
for col in bill_columns:
    
    # define the new column name
    new_column_name = 'ratio_{}_to_LIMIT'.format(col)
    
    # perform the ratio operation, and assign it to the new column
    ohe_data[new_column_name]=ohe_data[col]/ohe_data['LIMIT_BAL']

In [99]:
# as expected, we added 6 new columns (we had 33 before)
ohe_data.shape

(30000, 43)

### Quality assurance of the new columns

Let's have a look at this new columns: it is always a good idea to perfrom a check and see it if all makes sense

In [100]:
#lovely list comprehension
ohe_data[['ratio_{}_to_LIMIT'.format(col) for col in bill_columns]].describe()

,ratio_BILL_AMT1_to_LIMIT,ratio_BILL_AMT2_to_LIMIT,ratio_BILL_AMT3_to_LIMIT,ratio_BILL_AMT4_to_LIMIT,ratio_BILL_AMT5_to_LIMIT,ratio_BILL_AMT6_to_LIMIT
count,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000
mean,0.423771,0.411128,0.392192,0.359503,0.333108,0.318585
std,0.411462,0.404555,0.396449,0.368686,0.350542,0.345301
min,-0.619892,-1.395540,-1.025100,-1.374500,-0.876743,-1.509530
25%,0.022032,0.018318,0.016030,0.014299,0.011133,0.007800
50%,0.313994,0.296057,0.273135,0.242066,0.212026,0.185224
75%,0.829843,0.806500,0.755107,0.667937,0.602245,0.582169
max,6.455300,6.380500,10.688575,5.146850,4.935500,3.885550

# Functions on rows

Above we have seen how to apply a functoin on a column value.<br>
But what about applying a function on rows. <br>

For instance, if you want to compute the average bill

In [101]:
def find_mean(df, columns):
    
    sum_ = 0
    for column in columns:
        sum_ += df[column]
        
    return sum_

In [102]:
data['average_bill'] = data.apply(lambda x: find_mean(x,bill_columns), axis=1)

In [103]:
(
    data.apply(lambda x: find_mean(x,columns), axis=1)
    .head()
)

0      7704.0
1     17077.0
2    101653.0
3    231334.0
4    109339.0
dtype: float64

# Exercise (20 minutes)

Earlier we looked into fitting 6 points with a linear regression.<br>
Now we want to use it to our advantage, by building a feature that tells us something about

# Exporting the dataframe to a file 

The dataframe can be exported to different format, using different functions, with the most common being:<br>
* `to_csv()`: save it to a csv (comma separated values) file
* `to_pickle()`: save it to pickle. Pickle is a compression of python objects. It is useful to save any form of object (like your data, but also models, arrays etc) that can be read in another python session
* `to_json()`: save it to json
* `to_excel()`: well, we work in a bank, sometimes we need excel as well :(

Read the documentation of each function, to be sure you do not miss some important details

In [ ]:
ohe_data.to_csv('data/processed_data_by_trainees.csv')

In [ ]:
# lets see the content of the folder data (! executes a unix command, but this goes beyond the scope of this training)
! ls -lh data

# Plotting with pandas
Pandas has some integrated functions to do quick plots

#### Histograms

In [ ]:
data['AGE'].hist(color='blue')

#### Scatter plots

In [ ]:
data.plot(kind='scatter', x='BILL_AMT1', y='PAY_AMT1')

### Plot histograms by different groupby keys
Example, how doe the age distribution for male and female look like?

In [ ]:
data[['AGE','SEX']].hist(by='SEX', figsize=(12, 8))

In [ ]:
data[[col for col in data.columns if 'PAY_AMT' in col]].plot.box(figsize=(20, 8))

### Time series

`Definition`: a time series is a series of data points indexed (or listed or graphed) in time order. Most commonly, a time series is a sequence taken at successive equally spaced points in time. Thus it is a sequence of discrete-time data.

In pandas you can plot time series as well.
By selecting a column and then calling plot, it will plot the values ordered by the index

In [ ]:
# This is not really a time series (as each index represent a different client, so they are not a dependent sequence), 
# but we show it here for the sake of teaching the pandas API 
data['PAY_AMT1'].plot()